snlkuharlocal/src/DataProcessors/ВыгрузкаОстатковОзон/ВыгрузкаОстатковОзон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаОстатковОзон</name>
  <tabularSections>
    <name>Ном</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/AccumulationRegisters/РезервыТМЦ/РезервыТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ПредварительныйЗаказКлиента</types>
      <types>DocumentRef.ПродажаИМ</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ВиртуальныйРезерв</types>
      <types>DocumentRef.ЗаявкаНаПерепаковку</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Catalogs/КлючиБезопасногоХранилищаДанных/КлючиБезопасногоХранилищаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиБезопасногоХранилищаДанных</name>
  <comment>// Ихсанов Д. А. 30.09.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2523</comment>
  <predefined>
    <items>
      <name>ДанныеDocFlowRabbitПлатежнаяИнформацияИсходящийПоток</name>
      <description>Данные doc flow rabbi платежная информация исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitБанковскиеСчетаВходящийПоток</name>
      <description>Данные doc flow rabbit банковские счета входящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitБанковскиеСчетаВходящийПотокТест</name>
      <description>Данные doc flow rabbit банковские счета входящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitБанковскиеСчетаИсходящийПоток</name>
      <description>Данные doc flow rabbit банковские счета исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitБанковскиеСчетаИсходящийПотокТест</name>
      <description>Данные doc flow rabbit банковские счета исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitДоговорыВходящийПоток</name>
      <description>Данные doc flow rabbit договоры входящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitДоговорыВходящийПотокТест</name>
      <description>Данные doc flow rabbit договоры входящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitДоговорыИсходящийПоток</name>
      <description>Данные doc flow rabbit договоры исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitДоговорыИсходящийПотокТест</name>
      <description>Данные doc flow rabbit договоры исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitЗНОВходящийПоток</name>
      <description>Данные doc flow rabbit ЗНО входящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitЗНОВходящийПотокТест</name>
      <description>Данные doc flow rabbit ЗНО входящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitЗНОИсходящийПоток</name>
      <description>Данные doc flow rabbit ЗНО исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitЗНОИсходящийПотокТест</name>
      <description>Данные doc flow rabbit ЗНО исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitКонтрагентыВходящийПоток</name>
      <description>Данные doc flow rabbit контрагенты входящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitКонтрагентыВходящийПотокТест</name>
      <description>Данные doc flow rabbit контрагенты входящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitКонтрагентыИсходящийПоток</name>
      <description>Данные doc flow rabbit контрагенты исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitКонтрагентыИсходящийПотокТест</name>
      <description>Данные doc flow rabbit контрагенты исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitПлатежнаяИнформацияИсходящийПотокТест</name>
      <description>Данные doc flow rabbit платежная информация исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеHTTPПубликацииSNL</name>
      <description>Данные HTTP публикации SNL</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPCollant</name>
      <description>Данные авторизации к FTP collant</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPWatcom</name>
      <description>Данные авторизации к FTP Watcom</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPКлиента</name>
      <description>Данные авторизации к FTP клиента</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPКонтур</name>
      <description>Данные авторизации к FTP контур</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPНаСайтеCollant</name>
      <description>Данные авторизации к FTP на сайте collant</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPСклада</name>
      <description>Данные авторизации к FTP Склада</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКHTTPОбмену</name>
      <description>Данные авторизации к http обмену</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКWebСервисуСклада</name>
      <description>Данные авторизации к web сервису склада</description>
    </items>
    <items>
      <name>ДанныеАвторизацииАрхивЛогов</name>
      <description>Данные авторизации к базе архива логов</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКЗУП_31</name>
      <description>Данные авторизации к ЗУП_31</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКЗУП_ЕЕ</name>
      <description>Данные авторизации к ЗУП_ЕЕ</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКПочтовомуСерверуХелпДеск</name>
      <description>Данные авторизации к почтовому серверу</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКПочтовомуСерверуRobot</name>
      <description>Данные авторизации к почтовому серверу robot</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКПочтовомуСерверуScud</name>
      <description>Данные авторизации к почтовому серверу scud</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКПочтовомуСерверуЕкод</name>
      <description>Данные авторизации к почтовому серверу Екод</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКСайтуCollant</name>
      <description>Данные авторизации к сайту Collant</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКСайтуIdexgroup</name>
      <description>Данные авторизации к сайту idexgroup</description>
    </items>
    <items>
      <name>ДанныеАвторизацииОзонТокен</name>
      <description>Данные авторизации озон токен</description>
    </items>
    <items>
      <name>ДанныеАвторизацииРВБ_БТК_Токен</name>
      <description>Данные авторизации РВБ БТК токен</description>
    </items>
    <items>
      <name>ДанныеАвторизацииРВБ_ЕЕЭ_Токен</name>
      <description>Данные авторизации РВБ ЕЕЭ токен</description>
    </items>
    <items>
      <name>ДанныеАвторизацииФормированиеБланкаSecretKey</name>
      <description>Данные авторизации формирование бранка Secret Key</description>
    </items>
    <items>
      <name>ПутьКФайлуОповещенияОбОшибкеТСД_RDP</name>
      <description>Путь к файлу оповещения об ошибке ТСД RDP</description>
    </items>
    <items>
      <name>ХранилищеДанныхS3</name>
      <description>Хранилище данных s3</description>
    </items>
  </predefined>
  <tabularSections>
    <name>ИспользуемыеТипыКлючей</name>
    <attributes>
      <name>ТипКлюча</name>
      <type>
        <types>EnumRef.ТипыКлючейБезопасногоХранилищаДанных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/ВыгрузкаОстатковОзон/ObjectModule.bsl
Перем ПутиПапок Экспорт;
Перем ПутиФайлов Экспорт;
Перем ИмяПути Экспорт;
Перем Контрагент Экспорт;
Перем ТипШк Экспорт;
Перем КодМетро Экспорт; 
Перем Файлы Экспорт;
Перем Ошибки Экспорт;
Перем КритичОшибки,КритичОшибкиЛента,КритическиеОшибкиОзон Экспорт;
Перем ТЗПЕчать,ТЗШапка,АктШапка,АктТаблица Экспорт;
Перем Ашан Экспорт;
Перем НомПП;
Перем Отказ;
Перем ОшибкиАртикул;
Перем SQLiteObject;
Перем ВыборкаОстаткиДляПоиска,ТЗОстатков,тз2Остатков Экспорт;




Функция POSTЗапросИз1С(Команда,ТелоДж,типВыхФайла=".json") Экспорт
	
	
	// это продуктив пароли
	
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//НашКлючАдмин = "*#*#*#";
	НашКлючАдмин = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииОзонТокен).Токен;
	// Ихсанов Д. А. Конец  14.10.2025
	КлиентИД = 44219;
	////
	// тестовые пароли
	//КлиентИД = 836;                                                    
	//НашКлючАдмин ="*#*#*#";
	//
	
	Лимит = 10;
	Дата1 = ТекущаяДата();
	Дата2 = ТекущаяДата();
	
	ИмяВыходногоФайла = ПолучитьИмяВременногоФайла(типВыхФайла); //(".pdf");
	
	ДатаНачала =Формат(НачалоДня(Дата1),"ДФ=""гггг-ММ-дд""");
	ДатаКонца = Формат(КонецДня(Дата2),"ДФ=""гггг-ММ-дд""");
	
	//АдресТ = "cb-api.ozonru.me"	; // тестовый сервер
	АдресТ = "api-seller.ozon.ru"	; // продуктив
	попытка                          
		Соединение = Новый HTTPСоединение(АдресТ,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);  
	исключение
		//Сообщить(ОписаниеОшибки());
	конецПопытки;
	
	HTTP_запрос = новый HTTPзапрос();
	
	HTTP_запрос.АдресРесурса = Команда;
	
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("Accept", "text/xml");
	ЗаголовокHTTP.Вставить("Accept-Language", "ru");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("Content-Language", "ru");
	ЗаголовокHTTP.Вставить("Content-Charset", "utf-8");
	// потмо изменить
	ЗаголовокHTTP.Вставить("Host", АдресТ); //"https://seller-api.sc.prod.s.o3.ru/v1/categories/tree?language=DEFAULT");
	ЗаголовокHTTP.Вставить("Client-Id", КлиентИД);
	ЗаголовокHTTP.Вставить("Api-Key", НашКлючАдмин );	
	//Host: api-seller.ozon.ru
	
	
	HTTP_запрос.Заголовки = ЗаголовокHTTP;
	//	ТелоДЖ="C:\Users\nechaeva\AppData\Local\Temp\8\123.json";  - так работает , на работчем столе лежит
	//HTTP_запрос.УстановитьТелоИзСтроки(ТелоДЖ,,ИспользованиеByteOrderMark.НеИспользовать);
	HTTP_запрос.УстановитьИмяФайлаТела(ТелоДЖ);
	
	
	Попытка
		//Отправляем для обрааботки на наш сервер
		Ответ = Соединение.ОтправитьДляОбработки(HTTP_запрос);  // ИмяВыходногоФайла
		
	Исключение
		#Если клиент Тогда
			Сообщить(ОписаниеОшибки());
		#КонецЕсли   
	КонецПопытки;
	//	ответ.ПолучитьИмяФайлаТела()
	Соединение.ОтправитьДляОбработки(HTTP_запрос,ИмяВыходногоФайла);
	//Сообщить(ИмяВыходногоФайла+"  - имя ответа");
	
	возврат Ответ;
	
	//--------------------------------------------------------------------------------------------------------------------------------
	
		
КонецФункции




Функция ПолучитьАртикулыМатрицыСп() Экспорт
	
	// пункт доставки добавить
	
	
	
	// для договоров не по матрице
	НеИспользоватьМартицуПоДоговору=ложь;
	ТЗ = новый ТаблицаЗначений;
	Тз.Очистить();
	
	Контрагент=справочники.Контрагенты.НайтиПоКоду("SSP-4991");
	Договор=Справочники.Договоры.НайтиПоКоду("SNL-028617");
	дата1 = ТекущаяДата();
	
	Попытка
		Если контрагент.ИспользоватьНоменклатурнуюМатрицу и не НеИспользоватьМартицуПоДоговору Тогда
			// проверяем по какому типу расчитывать цену - с учетом договора или нет(если по договору не найдено). 
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Матрица.Ссылка КАК Ссылка1
			|ИЗ
			|	Документ.Матрица КАК Матрица
			|ГДЕ
			|	Матрица.Контрагент = &Контрагент
			|	И Матрица.Дата <= &Дата1
			|	И Матрица.ДатаОкончания >= &Дата2
			|	И Матрица.Договор = &Договор
			|	И Матрица.Проведен = истина
			|АВТОУПОРЯДОЧИВАНИЕ";
			
			
			Запрос.УстановитьПараметр("Дата2",НачалоДня(дата1));
			Запрос.УстановитьПараметр("Дата1",КонецДня(дата1));
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("Договор",Договор);
			ТЗЕстьМатрицаПоДоговору = Запрос.Выполнить().Выгрузить();
			
			
			//запрос на получение
			Запрос=Новый Запрос;
			Запрос.Текст=
			"ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура КАК Номенклатура,
			|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
			|	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
			|	МатрицаТовары.Ссылка КАК Ссылка,
			|	МатрицаТовары.НаименованиеКонтрагента КАК НаименованиеКонтрагента,
			|	МатрицаТовары.Кратность КАК Кратность,
			|	МатрицаТовары.ШККонтрагентаБлочок КАК ШККонтрагентаБлочок,
			|	МатрицаТовары.ШКСпайки КАК ШКСпайки,
			|	МатрицаТовары.МинимальныйОстатокКоличество КАК МинимальныйОстатокКоличество
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Дата <= &Дата1
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
			|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
			
			
			Если ТЗЕстьМатрицаПоДоговору.Количество()>0 Тогда
				ЕстьМатрицаПоДоговору = истина;
				//с учетом договора
				Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.Договор = &Договор";
				
			иначе
				ЕстьМатрицаПоДоговору = ложь;
			КонецЕсли;
			
			Попытка
				//Если сылка.ПостояннаяАкция Тогда
				//	Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.ПостояннаяАкция = истина";
				//	//постоянные акции только под галку
				//Иначе
				Запрос.Текст = Запрос.Текст +" И НЕ МатрицаТовары.Ссылка.ПостояннаяАкция";
				
				//КонецЕсли;
			Исключение
			КонецПопытки;	
			Запрос.Текст = Запрос.Текст +"	
			|УПОРЯДОЧИТЬ ПО
			|	МатрицаТовары.Ссылка.Дата УБЫВ
			|АВТОУПОРЯДОЧИВАНИЕ";
			
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("Договор",Договор);
			Запрос.УстановитьПараметр("Дата1",дата1);
			Запрос.УстановитьПараметр("ТекДата",дата1);
			
			тз1 = Запрос.Выполнить().Выгрузить();
			
			Возврат ТЗ1;
			
		КонецЕсли;
	исключение
		Возврат ТЗ;
	конецПопытки;	
	
	возврат ТЗ; //пустая таблица
	
КонецФункции




Функция ПолучитьАртикулыМатрицы_спд()Экспорт
	
	
	// для договоров не по матрице
	НеИспользоватьМартицуПоДоговору=ложь;
	ТЗ = новый ТаблицаЗначений;
	Тз.Очистить();
	
	Контрагент=справочники.Контрагенты.НайтиПоКоду("SSP-4991");
	Договор=Справочники.Договоры.НайтиПоКоду("SNL-028617");
	дата1 = ТекущаяДата();
	
	Попытка
		Если контрагент.ИспользоватьНоменклатурнуюМатрицу и не НеИспользоватьМартицуПоДоговору  Тогда
			// проверяем по какому типу расчитывать цену - с учетом договора или нет(если по договору не найдено). 
			//Запрос = Новый Запрос;
			//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|	Матрица.Ссылка КАК Ссылка1
			//|ИЗ
			//|	Документ.Матрица КАК Матрица
			//|ГДЕ
			//|	Матрица.Контрагент = &Контрагент
			//|	И Матрица.Дата <= &Дата1
			//|	И Матрица.ДатаОкончания >= &Дата2
			//|	И Матрица.Договор = &Договор
			//|	И Матрица.Проведен = истина
			//|АВТОУПОРЯДОЧИВАНИЕ";
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Матрица.Ссылка КАК Ссылка1
			|ИЗ
			|	Документ.Матрица.ПунктыДоставки КАК Матрица
			|ГДЕ
			|	Матрица.Ссылка.Контрагент = &Контрагент
			|	И Матрица.Ссылка.Дата <= &Дата1
			|	И Матрица.Ссылка.ДатаОкончания >= &Дата2
			|	И Матрица.Ссылка.Договор = &Договор
			|	И Матрица.Ссылка.Проведен = ИСТИНА
			|	И Матрица.ПунктДоставки = &ПДИМ
			|АВТОУПОРЯДОЧИВАНИЕ";
			
			
			Запрос.УстановитьПараметр("Дата2",НачалоДня(дата1));
			Запрос.УстановитьПараметр("Дата1",КонецДня(дата1));
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("Договор",Договор);
			Запрос.УстановитьПараметр("ПДИМ",Справочники.ПунктыДоставки.НайтиПоКоду("SNL-024031"));  // фбс озон
			
			ТЗЕстьМатрицаПоДоговору = Запрос.Выполнить().Выгрузить();
			
		//иначе
		//	ТЗЕстьМатрицаПоДоговору = текматрица;
		конецЕсли;
		
			//запрос на получение
			Запрос=Новый Запрос;
			Запрос.Текст=
			"ВЫБРАТЬ
			|	МатрицаТовары.Номенклатура КАК Номенклатура,
			|	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
			|	МатрицаТовары.АртикулКонтрагента КАК АртикулКонтрагента,
			|	МатрицаТовары.НаименованиеКонтрагента КАК НаименованиеКонтрагента,
			|	МатрицаТовары.Кратность КАК Кратность,
			|	МатрицаТовары.МинимальныйОстатокКоличество КАК МинимальныйОстатокКоличество,
			|	МатрицаТовары.ШККонтрагентаКоробка КАК Артикул2,
			|	МатрицаТовары.ШККонтрагентаДополнительный КАК Артикул1,
			|	МатрицаТовары.МинимальноеКоличество КАК МинимальноеКоличество
			|ИЗ
			|	Документ.Матрица.Товары КАК МатрицаТовары
			|ГДЕ
			|	МатрицаТовары.Ссылка.Дата <= &Дата1
			|	И МатрицаТовары.Ссылка.Контрагент = &Контрагент
			|	И МатрицаТовары.Ссылка.ДатаОкончания >= &ТекДата
			|	И МатрицаТовары.Ссылка.Проведен = ИСТИНА";
					
			
			//Если ТекМатрица= документы.Матрица.ПустаяСсылка() ТОгда
			//	
				Запрос.Текст = Запрос.Текст +"	И МатрицаТовары.Ссылка В ИЕРАРХИИ(&спМатриц)";
			//иначе
		//		Запрос.Текст = Запрос.Текст +"	И МатрицаТовары.Ссылка = (&спМатриц)";
		
		//	КонецЕсли;
			
			//Если ТекМатрица= документы.Матрица.ПустаяСсылка() ТОгда
				
				//Если ТЗЕстьМатрицаПоДоговору.Количество()>0 Тогда
				//	ЕстьМатрицаПоДоговору = истина;
				//	//с учетом договора
				//	Запрос.Текст = Запрос.Текст +" И МатрицаТовары.Ссылка.Договор = &Договор";
				//иначе
				//	ЕстьМатрицаПоДоговору = ложь;
				//КонецЕсли;
				
		//	конецЕсли;
			
			
			Запрос.Текст = Запрос.Текст +"	
			|УПОРЯДОЧИТЬ ПО
			|	МатрицаТовары.Ссылка.Дата УБЫВ
			|АВТОУПОРЯДОЧИВАНИЕ";
			 Дата1= ТекущаяДата();
			Запрос.УстановитьПараметр("Контрагент",Контрагент);
			Запрос.УстановитьПараметр("Договор",Договор);
			Запрос.УстановитьПараметр("Дата1",КонецДня(Дата1));
			Запрос.УстановитьПараметр("ТекДата",Дата1);
			Запрос.УстановитьПараметр("спМатриц",ТЗЕстьМатрицаПоДоговору);
			
			
			тз1 = Запрос.Выполнить().Выгрузить();
			
			Возврат ТЗ1;
			
		
	исключение
			//	сообщить(ОписаниеОшибки()); 
				Возврат ТЗ;

	конецПопытки;	
	
	возврат ТЗ; //пустая таблица
	
КонецФункции



Процедура СообщитьМенеджеруОзон() Экспорт
	
	Если ПараметрыСеанса.Отладка Тогда
		Возврат;
	КонецЕсли;
		
	//Менеджер=СтрШапка.контрагент.Менеджер;
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//	Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Иначе
	//	Профиль.АдресСервераPOP3   = "87.236.190.180";
	//	Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//КонецЕсли;
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец

	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	//---------------------------------------------------------------
	//Попытка
	//	ИмяФайлаПечати=ФормированиеПечати(ТЗПечать,ТЗШапка); //+++
	//Исключение
	//	КритичОшибки.Добавить("Не сформирован файл печати! "+Символ(13));
	//КонецПопытки;
	
	// и прикрепляем файл;
	
	//----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	
	//Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	Сообщение.Получатели.Добавить("egorova_k@collant.ru");
	Сообщение.Получатели.Добавить("kulagina@collant.ru");
	//Сообщение.Получатели.Добавить("nikolaev@collant.ru");
	Сообщение.Получатели.Добавить("egorova@collant.ru");


	Сообщение.Отправитель="ecode@collant.ru";
		
	
	
	Сообщение.Тема=" Ошибки при загрузке остатков на сайт Озон ";
	сообщение.Важность = ВажностьИнтернетПочтовогоСообщения.Высокая;
	
	Строка=Символ(13)+Символ(13)+"       Добрый день!"; //+Символ(13)+Символ(13)+Строка("Новый заказ ИМ Озон № "+Док.номерЗаказа+".")+
	//+Символы.ПС+"Сформировано новое РНК № "+Док.номер+" "+Док.Дата+"."+Символ(13)+Символ(13);
	//Для рр=0 по файлы.Количество()-1 Цикл
	//	Строка=Строка+символы.ПС+Файлы[рр];
	//КонецЦикла;
	
	
	НомСтр=1;
	//Строка=Строка+Символы.ПС+символы.ПС+"Фактический адрес, пунк доставки: "+СтрШапка.ПунктДоставки;
	Строка=Строка+Символы.ПС;
	Если КритическиеОшибкиОзон.количество()>1 Тогда
		Строка=Строка+Символы.ПС+"Сообщения по загрузке данных:";
	КонецЕсли;	
	Если НЕ КритическиеОшибкиОзон=Неопределено и КритическиеОшибкиОзон.Количество()>0 Тогда
		Для рр=0 по КритическиеОшибкиОзон.Количество()-1 Цикл
			Строка=Строка+Символы.ПС+НомСтр+". "+КритическиеОшибкиОзон[рр];
			Строка=Строка+Символы.ПС;
			НомСтр=НомСтр+1;
		КонецЦикла;
	конецЕсли;
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	
	Сообщение.Тексты.Добавить(Строка);
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
	исключение
		
		//КритичОшибки.Добавить("Не возможно отправить сообщение!   "+ОписаниеОшибки() );
		////Катаев+ 27/02/14 Катаев+
		//КритичОшибки.Добавить("Узел - "+ПланыОбмена.Основной.ЭтотУзел());
		//КритичОшибки.Добавить("Менеджер - "+Менеджер);
		//КритичОшибки.Добавить("Заказ ЕКОД - "+СтрШапка.номЗаказа);
		////Катаев- 27/02/14
		//для каждого пол из сообщение.Получатели цикл
		//КритичОшибки.Добавить("Получатель="+пол+" "+пол.ОтображаемоеИмя);
		//конеццикла;
	конецПопытки;
	Почта.Отключиться();
//	УдалитьФайлы(ИмяФайлаПечати);     //+++
	
КонецПроцедуры


Функция ПерезаполнениеОстатков()
	 //Еще есть не распреде/
	// ЕстьНераспред=0;
	//  	Для каждого текстрока из тзОстатков цикл
	//		
	//	// тут заполним остатки. // сначало по минимуму
	//	НайденнаяСтрока = ВыборкаОстаткиДляПоиска.Найти(ТекСтрока.комплектующее,"Номенклатура");
	//	
	//	Если НайденнаяСтрока <> Неопределено ТОгда
	//		//нашли остатки по комплектующим
	//		остаток = 0;			
	//		// количество комплектов посчитаем.
	//		ИсхК =НайденнаяСтрока.колконфакт;
	//		кратность = текСтрока.КолВКомпл;
	//		минКолво = текстрока.МинимальныйОстатокКоличество*кратность;
	//		ОстатокВсего =Цел(ИсхК/кратность);
	//		Если ОстатокВсего > текстрока.МинимальныйОстатокКоличество ТОгда
	//			остаток = текстрока.МинимальныйОстатокКоличество;
	//		Иначе
	//			Остаток =Цел(ИсхК/кратность);
	//		КонецЕсли;
	//		
	//		текстрока.КолОстатков = текстрока.КолОстатков +остаток;
	//		НайденнаяСтрока.колконфакт = ИсхК-(Остаток*кратность);
	//		Если НайденнаяСтрока.колконфакт>0 Тогда
	//			ЕстьНераспред =1;
	//		КонецЕсли;	
	//	Иначе
	//	конецЕсли;
	//	
	//	
	//конеццикла;		

	//возврат ЕстьНераспред; 
	
	
	 //Еще есть не распреде/
	//нечаева 10,08,21+++ 
	ЕстьНераспред=0;
	Для каждого текстрока из тзОстатков цикл
		
		// тут заполним остатки. // сначало по минимуму
		НайденнаяСтрока = ВыборкаОстаткиДляПоиска.Найти(ТекСтрока.комплектующее,"Номенклатура");
		
		Если НайденнаяСтрока <> Неопределено ТОгда
			//нашли остатки по комплектующим
			остаток = 0;			
			// количество комплектов посчитаем.
			ИсхК =НайденнаяСтрока.колконфакт;
			кратность = текСтрока.КолВКомпл;
			минКолво = текстрока.МинимальноеКоличество*кратность;
			ОстатокВсего =Цел(ИсхК/кратность);
			Если ОстатокВсего > текстрока.МинимальноеКоличество ТОгда
				остаток = текстрока.МинимальноеКоличество;
			Иначе
				Остаток =Цел(ИсхК/кратность);
			КонецЕсли;
			
			Если текстрока.КолОстатков = неопределено тогда
				текстрока.КолОстатков = 0;
			КонецЕсли;	
			
			
			попытка
				текстрока.КолОстатков = текстрока.КолОстатков +остаток;
			исключение
				// текстрока.КолОстатков = 0;
			конецпопытки;
			НайденнаяСтрока.колконфакт = ИсхК-(Остаток*кратность);
			Если НайденнаяСтрока.колконфакт>0 Тогда
				ЕстьНераспред =1;
			КонецЕсли;	
		Иначе
		конецЕсли;
		
		
	конеццикла;		
	//нечаева 10,08,21---
	
	
	возврат ЕстьНераспред; 
	
	
	
	
КонецФункции	


Процедура загрузитьостатки()Экспорт
	
	//ЗаписатьВЛог("Екод","1 . загрузка озон тест","Информация");
	// максимум можем пердедать 100 товаров за раз.
	
	// получение списка отправлений за день.
	
	Команда = "/v1/product/import/stocks";  // считывает заказы с сайта
	ТелоДЖ = "";
	
	// склад пока не верный тут!!!!
	
	Контрагент=справочники.Контрагенты.НайтиПоКоду("SSP-4991");
	//	Склад = справочники.Склады.НайтиПоКоду("STC-81");      //STC-60
	
	Склад = справочники.Склады.НайтиПоКоду("STC-81");
	ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".json");
//	сообщить(ИмяВыходногоФайлаДж);
	
	//    {
	//      "product_id": 120000,
	//      "offer_id": "PRD-1",
	//      "stock": 20
	//    },
	
	
	//ТовНОм = номМатрица.Товары;
	Товары = новый Массив;
	
	// кусок кода, для полной выгрузки остатков.
	// они принимают только файлы по 100 штук.
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(Остатки.СуммаКонечныйОстаток) КАК СебестоимостьБух,
	|	СУММА(Остатки.КоличествоКонечныйОстаток - ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК КолКонФакт,
	|	СУММА(ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК Резерв,
	|	Остатки.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ), КОНЕЦПЕРИОДА(&дата1, ДЕНЬ), Период, , Склад В ИЕРАРХИИ (&Склады)) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.ОстаткиИОбороты(НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ), КОНЕЦПЕРИОДА(&дата1, ДЕНЬ), Период, , Склад В ИЕРАРХИИ (&Склады)) КАК Резервы
	|		ПО Остатки.Номенклатура = Резервы.Номенклатура
	|			И Остатки.Склад = Резервы.Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Номенклатура";
	
	
	Если Ном.Количество()>0 Тогда
		СпН = ном.ВыгрузитьКолонку("Номенклатура");
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(Остатки.СуммаКонечныйОстаток) КАК СебестоимостьБух,
		|	СУММА(Остатки.КоличествоКонечныйОстаток - ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК КолКонФакт,
		|	СУММА(ЕСТЬNULL(Резервы.КоличествоКонечныйОстаток, 0)) КАК Резерв,
		|	Остатки.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(
		|			НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ),
		|			КОНЕЦПЕРИОДА(&дата1, ДЕНЬ),
		|			Период,
		|			,
		|			Склад В ИЕРАРХИИ (&Склады)
		|				И Номенклатура В ИЕРАРХИИ (&Ном)) КАК Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.ОстаткиИОбороты(
		|				НАЧАЛОПЕРИОДА(&Дата1, ДЕНЬ),
		|				КОНЕЦПЕРИОДА(&дата1, ДЕНЬ),
		|				Период,
		|				,
		|				Склад В ИЕРАРХИИ (&Склады)
		|					И Номенклатура В ИЕРАРХИИ (&Ном)) КАК Резервы
		|		ПО Остатки.Номенклатура = Резервы.Номенклатура
		|			И Остатки.Склад = Резервы.Склад
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.Номенклатура";
		
		Запрос.УстановитьПараметр("ном",СпН);
		
	КонецЕсли;	
	
	
	
	
	
	Запрос.УстановитьПараметр("Склады",склад);
	Запрос.УстановитьПараметр("Дата1",текущаядата());
	РезультатЗапроса = Запрос.Выполнить();
	СпНом = РезультатЗапроса.Выгрузить();
	КолНом = СПНом.Количество();
	//сообщить("На складе -"+колНом)   ;
	ВыборкаОстаткиДляПоиска = РезультатЗапроса.Выгрузить();
	
	ВыборкаОстаткиДляПоиска.Колонки.Добавить("ном");
	ВыборкаОстаткиДляПоиска.Колонки.Добавить("кол");
	
	
	тзОстатков = новый ТаблицаЗначений;
	//тз1.Колонки.Добавить("Комплектующее");
	//тз1.Колонки.Добавить("КолВКомпл");
	
	тзОстатков = ПолучитьАртикулыМатрицы_СПД();  // по пункту доставки получаем
	//сообщить("в матрице - "+тз1.количество());
	тзОстатков.Колонки.Добавить("Комплектующее");
	тзОстатков.Колонки.Добавить("КолВКомпл");
	тзОстатков.Колонки.Добавить("КолОстатков");
	
	// новое 01,06,21 
	
		
	
	ТЗ2Остатков = ТЗОстатков.скопировать();; //-- тут будут итоговые остатки
	//развернем все по комплектующим, потом остатки будем распределять.
	
	Для каждого текстрока из тз2Остатков цикл
		
	
		Если текстрока.номенклатура.коплектующие.количество()>1 Тогда
			
			для каждого тстр из  текстрока.номенклатура.коплектующие цикл
				нСтр = тзостатков.добавить();
				нстр.Номенклатура=текстрока.номенклатура;
			//	нстр.КодПроизводителя=текстрока.КодПроизводителя;
				нстр.НаименованиеКонтрагента=текстрока.НаименованиеКонтрагента;
				нстр.АртикулКонтрагента=текстрока.АртикулКонтрагента;
				нстр.ШККонтрагента=текстрока.ШККонтрагента;

				нстр.МинимальныйОстатокКоличество=текстрока.МинимальныйОстатокКоличество;
				нстр.МинимальноеКоличество = текстрока.МинимальноеКоличество;
				нстр.колОстатков = 0;

				//Нстр.КолВКомпл = тстр.количество;

				
				
				нстр.комплектующее = тстр.Номенклатура;
				нстр.КолВКомпл = тстр.количество;
				Если  текСтрока.МинимальныйОстатокКоличество = 0 тогда
					Если   текСтрока.МинимальноеКоличество>0 Тогда
						нстр.МинимальныйОстатокКоличество = текСтрока.МинимальноеКоличество; 
					иначе
						продолжить;
						
					конецЕсли;
				конецЕсли;	
				Текстрока.колОстатков = 0;
				
				
				Если  нстр.МинимальныйОстатокКоличество < нстр.КолВКомпл тОгда
					
					 нстр.МинимальныйОстатокКоличество= нстр.КолВКомпл;
					 
				конецЕсли;	
				
						
			конеццикла
			
						
		КонецЕсли;
		
	

	 конеццикла;
	 
	 //---------------------------------------------------
	
	  
	
	
	
	// сначала таблицу получим, потом будем передавать остатки;
	Для каждого текстрока из тзОстатков цикл
			
		
		Если текстрока.номенклатура.коплектующие.количество()=0 Тогда

			Текстрока.комплектующее = текстрока.номенклатура;
			Текстрока.КолВКомпл = 1;
			Текстрока.колОстатков = 0;
			текстрока.МинимальныйОстатокКоличество = 1;
			

		конецЕсли;
		
		
		Если текстрока.номенклатура.коплектующие.количество()=1 Тогда

			Текстрока.комплектующее = текстрока.номенклатура.коплектующие[0].номенклатура;
			Текстрока.КолВКомпл = текстрока.номенклатура.коплектующие[0].количество;
			Текстрока.колОстатков = 0;
			текстрока.МинимальныйОстатокКоличество = Текстрока.КолВКомпл;
			

		конецЕсли;

		Если текстрока.номенклатура.коплектующие.количество()>1 и Текстрока.комплектующее = справочники.Номенклатура.ПустаяСсылка()  Тогда
		    Текстрока.колОстатков = 0;

			продолжить;
			
		КонецЕсли;
		
		 		
		// тут заполним остатки. // сначало по минимуму
		НайденнаяСтрока = ВыборкаОстаткиДляПоиска.Найти(ТекСтрока.комплектующее,"Номенклатура");
		
		Если НайденнаяСтрока <> Неопределено ТОгда
			//нашли остатки по комплектующим
			остаток = 0;			
			// количество комплектов посчитаем.
			ИсхК =НайденнаяСтрока.колконфакт;
			кратность = текСтрока.КолВКомпл;
			минКолво = текстрока.МинимальныйОстатокКоличество*кратность;
			ОстатокВсего =Цел(ИсхК/кратность);
			Если ОстатокВсего > текстрока.МинимальныйОстатокКоличество ТОгда
				остаток = текстрока.МинимальныйОстатокКоличество;
			Иначе
				Остаток =Цел(ИсхК/кратность);
				
			КонецЕсли;
			
			текстрока.КолОстатков = остаток;
			НайденнаяСтрока.колконфакт = ИсхК-(Остаток*кратность);
		Иначе
		конецЕсли;
		
		
	конеццикла;		
	
	//*---------
	//------------------------------------------------
	пп=1;
	зн = 0;
	Для ПП=1 по 10 цикл
		
		Зн =  ПерезаполнениеОстатков() ;
		// если уже нет распределенных прерываем
		Если зн = 0 ТОгда
			прервать;
		КонецЕсли;
		
		пп=пп+1;
	КонецЦикла;
	
	
	// проверка по комплектации
	
	
	
	
	
	
	//---------------------------------------------------
	// последний заход распределяем все , что осталось.
	// сначала таблицу получим, потом будем передавать остатки;
	Для каждого текстрока из тзОстатков цикл
		
		 
		
		// тут заполним остатки. // сначало по минимуму
		НайденнаяСтрока = ВыборкаОстаткиДляПоиска.Найти(ТекСтрока.комплектующее,"Номенклатура");
		
		Если НайденнаяСтрока <> Неопределено ТОгда
			//нашли остатки по комплектующим
			остаток = 0;			
			// количество комплектов посчитаем.
			ИсхК =НайденнаяСтрока.колконфакт;
			кратность = текСтрока.КолВКомпл;
			минКолво = текстрока.МинимальныйОстатокКоличество*кратность;
			ОстатокВсего =Цел(ИсхК/кратность);
			Если ОстатокВсего > текстрока.МинимальныйОстатокКоличество ТОгда
				остаток = ОстатокВсего;
			Иначе
				Остаток =Цел(ИсхК/кратность);
				
			КонецЕсли;
			
			текстрока.КолОстатков = текстрока.КолОстатков +остаток;
			НайденнаяСтрока.колконфакт = ИсхК-(Остаток*кратность);
		Иначе
		конецЕсли;
		
		
	конеццикла;		
	
	//ЗаписатьВЛог("Екод","2 . загрузка озон тест","Информация");
	
	///---------------------------------------------------
	пп = 1;
	
	
	//-----------------------------------------------------------------------------------
	
	
	//теепрь заполним в копии остатки по спайкам. и по товарам.
	Для каждого текстрока из тз2Остатков цикл
		
		// просто штуки	
		Если текстрока.номенклатура.коплектующие.количество()=0 или текстрока.номенклатура.коплектующие.количество()=1    Тогда

			НайденнаяСтрока = тзОстатков.Найти(ТекСтрока.номенклатура,"Номенклатура");
			Если НайденнаяСтрока <> Неопределено ТОгда
				
				текстрока.КолОстатков = НайденнаяСтрока.КолОстатков ;
			КонецЕсли;

			

		конецЕсли;
		
	
		Если текстрока.номенклатура.коплектующие.количество()>1   Тогда

			Отбор = Новый Структура();
			Отбор.Вставить("Номенклатура",ТекСтрока.номенклатура);
			Строки = тзОстатков.НайтиСтроки(Отбор);
			МаксЗн = 10000;
			Если Строки.Количество() > 0 Тогда
				
				Для каждого ТекСтр из Строки цикл
					Если  ТекСтр.комплектующее <> Справочники.Номенклатура.ПустаяСсылка() и ТекСтр.комплектующее <> неопределено тогда
						
						Если  МаксЗн > текстр.колостатков тогда
							МаксЗн = текстр.колостатков;
						конецесли;
					конецЕсли;
				конеццикла;
				
			иначе
				текстрока.КолОстатков = 0;
				продолжить;
			КонецЕсли;
			
			текстрока.КолОстатков = МаксЗн ;
			
		конецЕсли;
		
		
				
		
	конеццикла;		
	
	 //********************************************************************************************	
	
	
	
	
	
	//   пп=1;
	
	
	
	
//	//было 01,06,21
//	// сначала таблицу получим, потом будем передавать остатки;
//	Для каждого текстрока из тзОстатков цикл
//		Если текстрока.номенклатура.коплектующие.количество()>0 Тогда
//			Текстрока.комплектующее = текстрока.номенклатура.коплектующие[0].Номенклатура;
//			Текстрока.КолВКомпл = текстрока.номенклатура.коплектующие[0].количество;
//			Если  текСтрока.МинимальныйОстатокКоличество = 0 тогда
//				Если   текСтрока.МинимальноеКоличество>0 Тогда
//					текстрока.МинимальныйОстатокКоличество = текСтрока.МинимальноеКоличество; 
//				иначе
//					продолжить;
//					текстрока.МинимальныйОстатокКоличество = 3;
//				конецЕсли;
//			конецЕсли;	
//			Текстрока.колОстатков = 0;
//		иначе
//			Текстрока.комплектующее = текстрока.номенклатура;
//			Текстрока.КолВКомпл = 1;
//			Текстрока.колОстатков = 0;
//			текстрока.МинимальныйОстатокКоличество = 1;

//		КонецЕсли;
//		
//		// тут заполним остатки. // сначало по минимуму
//		НайденнаяСтрока = ВыборкаОстаткиДляПоиска.Найти(ТекСтрока.комплектующее,"Номенклатура");
//		
//		Если НайденнаяСтрока <> Неопределено ТОгда
//			//нашли остатки по комплектующим
//			остаток = 0;			
//			// количество комплектов посчитаем.
//			ИсхК =НайденнаяСтрока.колконфакт;
//			кратность = текСтрока.КолВКомпл;
//			минКолво = текстрока.МинимальныйОстатокКоличество*кратность;
//			ОстатокВсего =Цел(ИсхК/кратность);
//			Если ОстатокВсего > текстрока.МинимальныйОстатокКоличество ТОгда
//				остаток = текстрока.МинимальныйОстатокКоличество;
//			Иначе
//				Остаток =Цел(ИсхК/кратность);

//			КонецЕсли;
//			
//			текстрока.КолОстатков = остаток;
//			НайденнаяСтрока.колконфакт = ИсхК-(Остаток*кратность);
//		Иначе
//		конецЕсли;
//		
//		
//	конеццикла;			
//	//*---------
//	//------------------------------------------------
//	пп=1;
//	зн = 0;
//	Для ПП=1 по 10 цикл
//		
//		Зн =  ПерезаполнениеОстатков() ;
//		// если уже нет распределенных прерываем
//		Если зн = 0 ТОгда
//			прервать;
//		КонецЕсли;
//		
//		пп=пп+1;
//	КонецЦикла;
//	
//	//---------------------------------------------------
//	// последний заход распределяем все , что осталось.
//	// сначала таблицу получим, потом будем передавать остатки;
//	Для каждого текстрока из тзОстатков цикл
//			
//		// тут заполним остатки. // сначало по минимуму
//		НайденнаяСтрока = ВыборкаОстаткиДляПоиска.Найти(ТекСтрока.комплектующее,"Номенклатура");
//		
//		Если НайденнаяСтрока <> Неопределено ТОгда
//			//нашли остатки по комплектующим
//			остаток = 0;			
//			// количество комплектов посчитаем.
//			ИсхК =НайденнаяСтрока.колконфакт;
//			кратность = текСтрока.КолВКомпл;
//			минКолво = текстрока.МинимальныйОстатокКоличество*кратность;
//			ОстатокВсего =Цел(ИсхК/кратность);
//			Если ОстатокВсего > текстрока.МинимальныйОстатокКоличество ТОгда
//				остаток = ОстатокВсего;
//			Иначе
//				Остаток =Цел(ИсхК/кратность);

//			КонецЕсли;
//			
//			текстрока.КолОстатков = текстрока.КолОстатков +остаток;
//			НайденнаяСтрока.колконфакт = ИсхК-(Остаток*кратность);
//		Иначе
//		конецЕсли;
//		
//		
//	конеццикла;		
//	
//	//ЗаписатьВЛог("Екод","2 . загрузка озон тест","Информация");

//	///---------------------------------------------------
////пп = 1;



//	возврат;
	// теперь сформируем файлы и выгрузим на сайт
	колвсего = 0;
	сч1=0;
	сч=0;
	сч2=тзОстатков.количество();
	колном = тзОстатков.количество();
	сч3=0;
//	возврат;
	Для каждого текстрока из тз2Остатков цикл
		
		Если ТекСТрока.артикул1<>"" тогда
			артикул = Текстрока.артикул1;
		иначеЕсли текстрока.артикул2<>"" тогда
			артикул = текстрока.артикул2;
		иначе
			артикул = текстрока.артикулКонтрагента;
		конецЕсли;	
		
	//	артикул = текстрока.артикулКонтрагента;
		
		СтрПРо= Новый Структура;
		
	//	СтрПро.Вставить("product_id",артикул);
		СтрПро.Вставить("offer_id",Текстрока.НаименованиеКонтрагента); 
		
		СтрПро.Вставить("stock",Текстрока.КолОстатков); 
		//СтрПро.Вставить("stock",0);
		
		Товары.Добавить(СтрПРо);
		сч=сч+1; 
		сч2=сч2-1;
		сч3=сч3+1;
		

		
		
		Если сч>=25 или сч = колНом тогда
			
			колном=колном+сч;

			сч=0;
			
			// отправить остатки на сайт;
			// обнуляем файл.
			ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".json");
	//		сообщить(ИмяВыходногоФайлаДж+ " с командой");
			//
			Запись = Новый ЗаписьJSON;
			ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( ,Символы.Таб);
			Запись.ОткрытьФайл(ИмяВыходногоФайлаДЖ,,,ПараметрыЗаписиJSON);
			
			НастройкиСериализации = Новый НастройкиСериализацииJSON;
			НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
			НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата; 
			
	//		Сообщить(" количество товаров "+товары.Количество());
			
			Данные = Новый Структура;
			Данные.Вставить("stocks",Товары);
			
			Попытка
				ЗаписатьJSON(Запись, Данные, НастройкиСериализации);
				Запись.Закрыть();
				// Возврат Истина;
			Исключение
				//сообщить(ОписаниеОшибки());
				// ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,"Прайс не сформирован, произошла ошибка " + ОписаниеОшибки());
				//  Возврат Ложь;
			КонецПопытки;;  
			//-------------------------------
			// выполнение пост запроса.
			//-------------------------------
		//	ЗаписатьВЛог("Екод","3 . загрузка озон тест","Информация");
			Результат = POSTЗапросИз1С(Команда,ИмяВыходногоФайлаДЖ,".json") ;    // ИмяВыходногоФайла?
			//-------------------------------
			р2=Результат.ПолучитьТелоКакСтроку();
		//	ЗаписатьВЛог("Екод","4 . загрузка озон тест","Информация");
									
		//	сообщить(р2);
			// сделаем обработку результата и вывод списка не обработанных
			//----------------
			//"product_id":205528508,"offer_id":"B_OmA 3834 Боксеры с внутренней резинкой Verde 44(S) (спайка 2шт.)","updated":false,"errors":[{"code":"NOT_FOUND_ERROR","message":"Product not found"}]
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку());
			
			Данные = ПрочитатьJSON(ЧтениеJSON, Ложь); // тут в структуру все выгружено
			//сообщить(Данные);
					
			попытка
			
			Для каждого ТекСтрока из Данные.result цикл
				Если Текстрока.updated = false ТОгда
					попытка
						Если   ТекСтрока.errors[0].code<> "SKU_STOCK_NOT_CHANGE" Тогда   // значит остаток не изменился
							
							#если клиент тогда
							сообщить("ШК коробки (product_id) - "+ТекСтрока.product_id+" наименование контрагента - "+Текстрока.offer_id+" , ошибка -"+ (ТекСтрока.errors[0].code) );
							#конецЕсли
							
							//КритическиеОшибкиОзон.Добавить("ШК коробки (product_id) - "+ТекСтрока.product_id+" наименование контрагента - "+Текстрока.offer_id+" , ошибка -"+ (ТекСтрока.errors[0].code));
	                       		
							Если ТекСтрока.errors[0].code ="NOT_FOUND" ТОгда
								КритическиеОшибкиОзон.Добавить(" "+Текстрока.offer_id+" , исправьте наименование контрагента в матрице!! Ошибка -"+ (ТекСтрока.errors[0].code)+ "   "+"");
							ИначеЕсли ТекСтрока.errors[0].code ="PRODUCT_IS_NOT_CREATED" ТОгда
								КритическиеОшибкиОзон.Добавить(" "+Текстрока.offer_id+" , товар не заведен полностью на сайте !! Ошибка - "+ (ТекСтрока.errors[0].code)+ "   "+"");
							ИначеЕсли ТекСтрока.errors[0].code ="INVALID_STATE" ТОгда
								КритическиеОшибкиОзон.Добавить(" "+Текстрока.offer_id+" , товар не заведен полностью на сайте !! Ошибка - "+ (ТекСтрока.errors[0].code)+ "   "+"");
							Иначе
								КритическиеОшибкиОзон.Добавить(" "+Текстрока.offer_id+"  Ошибка - "+ (ТекСтрока.errors[0].code)+ "   "+"");	
							КонецЕсли;
							
						
						КонецЕсли;
						
					исключение
					конецпопытки;
					
					
				конецесли;		
				
			КонецЦикла;
			//--------------------------------------------------------
			Данные.Очистить();
			Товары.Очистить();
		исключение
			//сообщить(р2);
			//сообщить(ОписаниеОшибки());
		конецПопытки;
		
		
		попытка
			Если Данные.error тогда
				
				// сообщение выводить;
			конецесли;
		исключение
		конецпопытки;	
		
		  Данные.Очистить();
			Товары.Очистить();

		
		
		КонецЕсли;
		
			
	КонецЦикла;
	// остатки которые остались		
	//сообщить(сч);	
	колном=колном+сч;
	//ЗаписатьВЛог("Екод","5 . загрузка озон тест","Информация");
	//сообщить("Всего выгружено: "+колном);
	// отправить остатки на сайт;
	// обнуляем файл.
	ИмяВыходногоФайлаДЖ = ПолучитьИмяВременногоФайла(".json");
//	сообщить(ИмяВыходногоФайлаДж+ " с командой");
	//
	Запись = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( ,Символы.Таб);
	Запись.ОткрытьФайл(ИмяВыходногоФайлаДЖ,,,ПараметрыЗаписиJSON);
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата; 
//	Сообщить(" количество товаров "+товары.Количество());
	Данные = Новый Структура;
	Данные.Вставить("stocks",Товары);
	
	Попытка
		ЗаписатьJSON(Запись, Данные, НастройкиСериализации);
		Запись.Закрыть();
		// Возврат Истина;
	Исключение
	//	сообщить(ОписаниеОшибки());
		// ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,"Прайс не сформирован, произошла ошибка " + ОписаниеОшибки());
		//  Возврат Ложь;
	КонецПопытки;;  
	////--------------------------------------------------------------------------------------------
	//// выполнение пост запроса.
	////-------------------------------
	Результат = POSTЗапросИз1С(Команда,ИмяВыходногоФайлаДЖ,".json") ;    // ИмяВыходногоФайла?
	////-------------------------------
	р2=Результат.ПолучитьТелоКакСтроку();
	
	попытка
			
			Для каждого ТекСтрока из Данные.result цикл
				Если Текстрока.updated = false ТОгда
					попытка
						Если   ТекСтрока.errors[0].code<> "SKU_STOCK_NOT_CHANGE" Тогда
							
							#если клиент тогда
							сообщить("ШК коробки (product_id) - "+ТекСтрока.product_id+" наименование контрагента - "+Текстрока.offer_id+" , ошибка -"+ (ТекСтрока.errors[0].code) );
							#конецЕсли
							
							КритическиеОшибкиОзон.Добавить("ШК коробки (product_id) - "+ТекСтрока.product_id+" наименование контрагента - "+Текстрока.offer_id+" , ошибка -"+ (ТекСтрока.errors[0].code));
	
							
						КонецЕсли;
						
					исключение
					конецпопытки;
					
					
				конецесли;		
				
			КонецЦикла;
		//----------------
	исключение
	конецпопытки;
	
	
//ы	сообщить(р2);
	
	//--------------------------------------------------------
	Данные.Очистить();
	Товары.Очистить();
	
//	СообщитьМенеджеруОзон();

	 Если  КритическиеОшибкиОзон.количество()>0 Тогда
		 
		 СообщитьМенеджеруОзон();
		
		КритическиеОшибкиОзон.очистить();
	КонецЕсли; 
	
	тзОстатков = неопределено;
	ВыборкаОстаткиДляПоиска = неопределено;
	
КонецПроцедуры

// проверить готовность документов



Процедура Сформировать(ТаблицаПараметров=НЕОПРЕДЕЛЕНО)    экспорт
	
	
	 
	////////+++
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец       
		ЗаписатьВЛог("Регламент","Отмена выполнения. Задача: Загрузка остатков ОЗОН. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		Возврат;
	КонецЕсли;


	ЗаписатьВЛог("Озон","Начало выполнения. Задача: ручная Загрузка остатков ОЗОН. !","Информация");                     
	
	Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
		 // получаем заказы за текущий день, минус день назад, на всякий случай.
		 загрузитьостатки();

	КонецЕсли;
	
	
	
	// теперь пропишем у уже загруженных заказов кода
	ЗаписатьВЛог("Озон","Конец выполнения. Задача: ручная Загрузка остатков Озон. !","Информация");                     
	

	
	
	
КонецПроцедуры	



Ошибки=Новый Массив;
Файлы=Новый Массив;

ПризнакЗаписиДокумента=Истина;

КритическиеОшибкиОзон=Новый Массив;
ВыборкаОстаткиДляПоиска  = новый таблицаЗначений;
тзОстатков   = новый таблицаЗначений;

тз2Остатков   = новый таблицаЗначений;
